app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" ASC LIMIT 1
---
  def index
    @articles = Article.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test 1"], ["body", ""], ["created_at", "2017-03-02 16:19:39.066917"], ["updated_at", "2017-03-02 16:19:39.066917"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save